docs/state_machines/dot/ru/cloudcomputing/status_Request.dot
digraph {
  rankdir=LR;
  node [shape=oval];
  edge [fontsize=10];

  created [label="новая"];
  sent [label="отправлено на рассмотрение"];
  approved [label="одобрено"];
  refused [label="отказано"];
  cancelled [label="отозвано пользоватлем"];
  __initial [shape=point];
  __initial -> created;
  created -> sent [label="to_sent"];
  sent -> approved [label="approve"];
  sent -> refused [label="refuse"];
  created -> cancelled [label="cancel"];
  sent -> cancelled [label="cancel"];
  approved -> cancelled [label="cancel"];
}
